In [85]:
import numpy as np
import pandas as pd

In [86]:
data = pd.read_csv(r'Downloads\StudentsPerformance.csv')

In [87]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [88]:
data.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [89]:
##1. Find out how many males and females participated in the test

In [90]:
data.value_counts('gender')

gender
female    518
male      482
dtype: int64

##From the dataset there were 518 females and 482 males

In [91]:
##2. What do you think about the students' parental level of education?

In [92]:
data.value_counts('parental level of education')

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
dtype: int64

In [ ]:
## parental level of eduacation is mostly in some colleges and there were least count of parents with Msc degree which is about 59 in number from the given list

In [93]:
##3. Who scores the most on average for math, reading and writing based on Gender and Test preparation course

In [94]:
data[['gender','math score']].groupby('gender').mean()

        math score
gender
female   63.376448
male     68.821577

In [ ]:
#In case of math score males have most average score which is about 68.82

In [95]:
data[['gender','reading score']].groupby('gender').mean()

        reading score
gender
female      72.590734
male        65.545643

In [ ]:
#In case of reading score females have most average score which is about 72.59

In [96]:
data[['gender','writing score']].groupby('gender').mean()

        writing score
gender
female      72.467181
male        63.446058

In [ ]:
#In case of writing score females have most average score which is about 72.46

In [97]:
data[['test preparation course','math score']].groupby('test preparation course').mean()

                         math score
test preparation course
completed                  69.96648
none                       63.78972

In [ ]:
#In case of math score test preparatiions who completed ones have most average score which is about 69.96

In [98]:
data[['test preparation course','reading score']].groupby('test preparation course').mean()

                         reading score
test preparation course
completed                    74.175978
none                         66.417445

In [ ]:
#In case of writing score (test preparatiions) who completed ones have most average score which is about 74.17

In [99]:
data[['test preparation course','writing score']].groupby('test preparation course').mean()

                         writing score
test preparation course
completed                    74.684358
none                         64.457944

In [137]:
#In case of reading score(test preparatiions)who completed ones have most average score which is about 74.69

In [100]:
##4.What do you think about the scoring variation for math, reading and writing based on Gender and Test preparation course

In [101]:
data[['gender','math score']].groupby('gender').std()

        math score
gender
female   16.029928
male     14.556411

In [102]:
data[['gender','reading score']].groupby('gender').std()

        reading score
gender
female      14.411018
male        14.149594

In [103]:
data[['gender','writing score']].groupby('gender').std()

        writing score
gender
female      14.844842
male        14.227225

In [104]:
data[['test preparation course','math score']].groupby('test preparation course').std()

                         math score
test preparation course
completed                 14.521847
none                      15.705689

In [105]:
data[['test preparation course','reading score']].groupby('test preparation course').std()

                         reading score
test preparation course
completed                    13.537572
none                         14.608896

In [106]:
data[['test preparation course','writing score']].groupby('test preparation course').std()

                         writing score
test preparation course
completed                    13.236412
none                         15.041667

In [138]:
##From the above result mostly females shows most score variation as compared with males in all cases like wrtiting,reading,and math score

In [ ]:
#Whether in case of test preparation course the one who completed course show least score variation in all.Mostly they maintain the scores.

In [107]:
data25=data.describe()

In [108]:
data25

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000

In [109]:
top = data.sort_values(by="math score",ascending=False)

In [132]:
top25=top.nlargest(250, ['math score'])

In [133]:
top25

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
853,male,group D,associate's degree,free/reduced,none,77,78,73
852,male,group D,some college,free/reduced,none,77,62,64

In [135]:
data25 = top25[["math score"]]

In [136]:
data25

     math score
999         100
996         100
515         100
517         100
516         100
..          ...
856          77
855          77
854          77
853          77
852          77

[250 rows x 1 columns]

In [ ]:
#Top 25% of the dataset of students based on their math score and their details are given in the above results